Dlubal.RFEM5.MemberLoad
Member load parameters

Dlubal.RFEM5.MemberLoad.No
Number

Dlubal.RFEM5.MemberLoad.ID
Identifier

Dlubal.RFEM5.MemberLoad.Comment
Comment

Dlubal.RFEM5.MemberLoad.Tag
Tag

Dlubal.RFEM5.MemberLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.MemberLoad.ReferenceTo
Type of reference objects

Dlubal.RFEM5.MemberLoad.ObjectList
List of objects on which is the load defined.

Dlubal.RFEM5.MemberLoad.Type
Type of member load

Dlubal.RFEM5.MemberLoad.Distribution
Distribution of member load

Dlubal.RFEM5.MemberLoad.Direction
Direction of member load

Dlubal.RFEM5.MemberLoad.Magnitude1
Magnitude 1

Dlubal.RFEM5.MemberLoad.Magnitude2
Magnitude 2

Dlubal.RFEM5.MemberLoad.Magnitude3
Magnitude 3

Dlubal.RFEM5.MemberLoad.Magnitude4
Magnitude 4

Dlubal.RFEM5.MemberLoad.Magnitude5
Magnitude 5

Dlubal.RFEM5.MemberLoad.Magnitude6
Magnitude 6

Dlubal.RFEM5.MemberLoad.DistanceA
Distance from the beginning of member.

Dlubal.RFEM5.MemberLoad.DistanceB
Distance from the end of member.

Dlubal.RFEM5.MemberLoad.RotaryMotionAxis
Axis of rotary motion

Dlubal.RFEM5.MemberLoad.LoadArray
Array of loads

Dlubal.RFEM5.MemberLoad.RelativeDistances
Relative distance in %

Dlubal.RFEM5.MemberLoad.OverTotalLength
Load over total length of member